In [2]:
import pandas as pd
import numpy as np

In [40]:
np.random.seed(0)
col=['kor','eng','art','math','gym','sci']
index=['jim','sam','tom','tim','bob']
data=np.random.randint(70,100,size=(5,6))
df=pd.DataFrame(data,index,columns=col)
df

     kor  eng  art  math  gym  sci
jim   82   85   91    70   73   97
sam   73   77   79    89   91   88
tom   74   93   76    94   94   82
tim   96   71   76    77   93   84
bob   94   87   75    95   83   78

[과제] iloc, loc를 이용해서 아래 요구사항들을 출력하세요
- df의 kor열을 series와 dataframe을 각각 출력
- df에서 sam의 math 점수를 출력 (2가지 방법)
- df에서 tom의 eng와 sci 점수를 출력 (2가지 방법)
- df에서 jim, tim의 eng, gym 점수를 출력
- df에서 jim, sam의 art, math, gym 점수를 출력

In [12]:
#df의 kor열을 series와 dataframe을 각각 출력
k_s=df.loc[:,'kor']
k_d=pd.DataFrame(df.kor)
print(k_s,type(k_s))
print(k_d,type(k_d))

jim    82
sam    73
tom    74
tim    96
bob    94
Name: kor, dtype: int32 <class 'pandas.core.series.Series'>
     kor
jim   82
sam   73
tom   74
tim   96
bob   94 <class 'pandas.core.frame.DataFrame'>

In [16]:
# df에서 sam의 math 점수를 출력 (2가지 방법)
s_m1=df.loc['sam','math']
s_m2=df.iloc[1,3]
print(s_m1)
print(s_m2)

89
89

In [21]:
# df에서 tom의 eng와 sci 점수를 출력 (2가지 방법)
t_es1=df.loc['tom',['eng','sci']]
t_es2=df.iloc[2,[1,5]]
print(t_es1)
print(t_es2)

eng    93
sci    82
Name: tom, dtype: int32
eng    93
sci    82
Name: tom, dtype: int32

In [23]:
# df에서 jim, tim의 eng, gym 점수를 출력
jt_eg=df.loc[['jim','tom'],['eng','gym']]
print(jt_eg)

     eng  gym
jim   85   73
tom   93   94

In [25]:
# df에서 jim, sam의 art, math, gym 점수를 출력
js_amg=df.loc[['jim','sam'],['art','math','gym']]
print(js_amg)

     art  math  gym
jim   91    70   73
sam   79    89   91

[과제] iloc, loc를 이용해서 아래 요구사항들을 출력하세요
- df에서 sam의 math 점수를 100으로 변경
- df에서 tom의 eng와 math 점수를 100으로 변경
- df에서 jim, tim의 kor, gym 점수를 null값으로 변경
- df에서 math와 gym 점수를 바꾸어 출력

In [41]:
df1=df.copy()

In [42]:
# df에서 sam의 math 점수를 100으로 변경
df1.loc['sam','math'] = 100

In [43]:
# df에서 tom의 eng와 math 점수를 100으로 변경
df1.loc['tom',['eng','math']] = 100

In [44]:
# df에서 jim, tim의 kor, gym 점수를 null값으로 변경
df1.loc[['jim','tim'],['kor','gym']] = np.nan

In [54]:
df1

      kor  eng  art  math   gym  sci
jim   NaN   85   91    70   NaN   97
sam  73.0   77   79   100  91.0   88
tom  74.0  100   76   100  94.0   82
tim   NaN   71   76    77   NaN   84
bob  94.0   87   75    95  83.0   78

In [52]:
# df에서 math와 gym 점수를 바꾸어 출력
newdf=df.copy()
newdf.math=df.gym
newdf.gym=df.math
newdf

     kor  eng  art  math  gym  sci
jim   82   85   91    73   70   97
sam   73   77   79    91   89   88
tom   74   93   76    94   94   82
tim   96   71   76    93   77   84
bob   94   87   75    83   95   78

[과제] 데이터 추출(인덱싱, 조건), 변경, 삭제, 정렬, 칼럼 병합(sibsp + parch = family) 등을 수행하여 데이터에서 인사이트를 찾아보세요.

- survived : 생존여부
- pclass : 등급
- sex : 성별
- age : 나이
- sibsp : 탑승한 형제/배우자 수
- parch : 탑승한 부모/자녀 수
- fare : 승객 지불 요금
- embarked : 승선항 (C = 쉘 부르그, Q = 퀸즈타운, S = 사우스 햄튼)
- adult_male : 성인 남성 여부
- deck : 플랫폼 번호
- alive : 생존 여부
- alone : 혼자 여부

In [ ]:
import seaborn as sns
df=sns.load_dataset('titanic')
newdf=pd.concat(['family'])